# config.py: Configuration constants for the Telegram bot
# Здесь храним конфигурационные параметры: токен бота, списки администраторов и бухгалтеров, и др.

BOT_TOKEN = "7326193661:AAHQZPvM2zBnJl-g0CPT_QWTzhvnckK5Q4A"  # TODO: вставьте токен вашего бота

# Списки ID пользователей Telegram, имеющих роли Админа и Бухгалтера
ADMIN_IDS = [1037664248, 789068055, 6981724635, 5942351384, 756383028, 7762892591]       # TODO: замените на реальные Telegram ID администраторов
ACCOUNTANT_IDS = [789068055, 1037664248, 6981724635, 5942351384, 756383028, 7651856323]  # TODO: замените на реальные Telegram ID бухгалтеров
MASTER_IDS = [1037664248, 789068055, 6981724635, 5942351384, 756383028, 7553162595]

# Путь к базе данных SQLite
DB_PATH = "data.db"

# Временные параметры напоминаний
EVENT_REMINDER_HOUR = 9  # час утра для напоминания о событиях (например, 9 = 9:00 утра в день события)

DATE_FORMAT = "%Y-%m-%d"
DATETIME_FORMAT = "%Y-%m-%d %H:%M"
DEFAULT_CONTRIBUTION_AMOUNT = 1000.0
